## Terraform Plan Result


### environments/stg/app/asg
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.asg.aws_autoscaling_group.this will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 2
      + force_delete                     = true
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "stg-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + region                           = "ap-southeast-2"
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = [
          + "arn:aws:elasticloadbalancing:ap-southeast-2:676259472245:targetgroup/stg-tg/021a8ec844a484f6",
        ]
      + vpc_zone_identifier              = [
          + "subnet-02893bf8e17f0bcf1",
          + "subnet-03973a0cb77fea6ee",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + capacity_reservation_specification (known after apply)

      + instance_refresh {
          + strategy = "Rolling"
          + triggers = [
              + "launch_template",
            ]

          + preferences {
              + instance_warmup              = "300"
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 90
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template {
          + id      = "lt-0e4f42175cb8fc1e2"
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "stg-asg"
        }
      + tag {
          + key                 = "Role"
          + propagate_at_launch = true
          + value               = "backend-ec2"
        }

      + traffic_source (known after apply)
    }

  # module.asg.aws_autoscaling_policy.cpu_target will be created
  + resource "aws_autoscaling_policy" "cpu_target" {
      + arn                     = (known after apply)
      + autoscaling_group_name  = "stg-asg"
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "stg-asg-cpu-scaling"
      + policy_type             = "TargetTrackingScaling"
      + region                  = "ap-southeast-2"

      + target_tracking_configuration {
          + disable_scale_in = false
          + target_value     = 50

          + predefined_metric_specification {
              + predefined_metric_type = "ASGAverageCPUUtilization"
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + asg_arn  = (known after apply)
  + asg_name = "stg-asg"
```

### environments/stg/app/ec2
```

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

### environments/stg/app/launch_template
```

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

### environments/stg/iam/role
```

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

### environments/stg/network/subnet
```

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```
<!-- Sticky Pull Request Commentterraform-plan -->